
print("Введите x")
a = float(input("a = "))

x = 3128
y = 0.321
z = 17

s = y*z*x
s2 = s + x

print (s2)


'''
print("Введите A и В")
a = float(input("a = "))
c = float(input("c = "))

s = 0.5 * a * c
b = (a ** 2 - 2*(c/2)**2)

s = 0.5 * b * a

h = 2*s/b

print ('Искомая высота {h}' .format(h=h))
'''

'''
print("Введите периметр большого треугольника")
p = float(input("p = "))

a = p / 3
b = a / 2

h = (a**2 - a**2) ** .5

s = a * h / 2

s1 = s / 4

c

'''

'''

# Найти периметр прямоугольника
print("Введите стороны А и B")
a = float(input("a = "))
b = float(input("b = "))

p = 2*(a + b)

print ('Периметр, {p}' .format(p=p))

s = p ** .5

print ('А если бы это был бы периметр квадарата, то его сторона была бы, {s}' .format(s=s))

'''